name_prefix@daroga0002 , thanks for looking into this.

`aws_eks_cluster.this` is kind of at the end of the chain of events, `module.eks.aws_iam_role.cluster[0]` gets replaced because of the name/prefix change, and the new role forces everything else to be replaced.

Here is my output after removing identifiable information and some irrelevant details:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "XXXX" -> (known after apply)
      [...]
      ~ role_arn                  = "XXXX" -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
      [...]
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "XXXX" -> (known after apply)
      [...]
      ~ url             = "XXXX" -> (known after apply) # forces replacement
      [...]
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      [...]
    }

  # module.eks.aws_iam_role.cluster[0] must be replaced
+/- resource "aws_iam_role" "cluster" {
      ~ arn                   = "XXXX" -> (known after apply)
      [...]
      ~ name                  = "XXXX" -> (known after apply)
      - name_prefix           = "XXXX" -> null # forces replacement
      [...]
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      [...] # role forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      [...] # role forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      [...] # role forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      [...] # role forces replacement
    }

  # module.eks.local_file.kubeconfig[0] must be replaced
-/+ resource "local_file" "kubeconfig" {
      ~ content              = <<-EOT
      [...]
        EOT -> (known after apply) # forces replacement
      [...]
    }

Plan: 8 to add, 1 to change, 8 to destroy.
```